---
title: "왜 프로그래밍 교육인가?"
date: 2019-10-01
categories: 교육 파이썬 프로그래밍
---

왜 수많은 교육 콘텐츠 중에 프로그래밍 콘텐츠를 만들려하는가?
많은 사람들이 프로그래밍을 가르치는데에 수많은 이유를 들곤 한다.
"논리적 사고방식을 배울 수 있다", "4차 산업혁명 시대에 소프트웨어가 중요하다" 등등.

나는 이런 거창한 이유는 모르겠다.
프로그래밍 콘텐츠를 만들려하는 이유는 지극히 개인적이며 단순하다.



1. "프로그래밍은 창조하는 작업이다"
나는 새로운 것을 만드는 것을 좋아한다.
아이디어를 생각하고 이를 구현하는 것. 이를 위해 프로그래밍은 최고의 방법이다. 
내가 재미를 느낀 것처럼 다른 누군가도 새로운 것을 만들어내면서 흥미를 느끼리라 생각한다.
다른 이들도 손 안에서 빠르게 만들어지는 결과물을 통해서 재미를 얻었으면 한다.


2. "교육은 사회 불평등 문제를 해결하는데 도움을 준다"
나는 사회의 많은 문제들이 '불평등'에서 발생한다고 생각한다.
그리고 '프로그래밍'은 불평등을 해결할 수 있는 효과적인 방법 중 하나라고 믿는다.
프로그래밍을 통해 저렴한 돈으로 서비스를 만들고, 많은 사람들에게 영향력을 줄 수 있다.



작은 것부터 하나씩 시작해본다.
누구나가 다 따라할 수 있는 그런 프로그래밍 교육 자료가 되기를 바란다.
